{
  "hearing_id": 33,
  "source": "politicopro",
  "committee": "SSJU",
  "subcommittee": "Antitrust, Competition Policy, and Consumer Rights",
  "title": "Deregulation and Competition: Reducing Regulatory Burdens to Unlock Innovation and Spur New Entry",
  "date": "2025-06-24",
  "time": "14:30 EDT",
  "raw_datetime": "06/24/2025 02:30 PM EDT",
  "total_segments": 2,
  "estimated_duration_minutes": 10.3,
  "imported_at": "2025-07-03T08:29:56.078413",
  "segments": [
    {
      "start": 0,
      "end": 464.0,
      "speaker": "CHAIR",
      "text": "All right call a hearing to order today's hearing addresses and important topic, a topic that I think is becoming increasingly important. Unlocking innovation and new entry into the marketplace by reducing anti competitive government regulations, regulations that in many instances secure the position of market incumbents to the exclusion of would be competitors, far too often federal regulations. Even those that are there that are intended to protect the American public in one way or another, many circumstances they end up creating a whipsaw effect and having some really ugly consequences, because they end up insulating businesses from competition. One thing we understand about competition is that it tends to bring prices down. And it tends to improve quality when competition is present present. But to the degree that competition is not present, the opposite tends to happen. So when regulations require expensive compliance costs that only large incumbents have the meaningful ability to comply with, while remaining competitive regulations become monopoly moats, rather than consumer protections. The economic cost is enormous. Now just last year, just new federal regulations, major rules promulgated by executive branch agencies put into law without any subsequent additional vote by Congress were presented to the President for signature veto or acquiescence, added a record $1.5 trillion in new regulatory compliance costs, just the regs put in place in 2024. Alone. Now, that doesn't include the previous regulations, which have been estimated, including last year's regulations, it's somewhere in the three to four, some would say more trillion dollars every single year. This starts to rival what Americans pay in their federal taxes. This is a huge draw on the economy, and it ends up disproportionately enduring to the detriment of America's poor and middle class. This also doesn't include the innovations that never happened, the businesses that were never launched, and the competitive pressure that never materialized, so as to bring quality up and prices down. President Trump has recognized this issue and in April issued an executive order directing the federal government under his administration to identify regulations that hold back American businesses and stifle competition, thus, ultimately harming consumers. The response has been remarkable, and with organizations across the country, across every major economic sector, submitting detailed comments about regulatory barriers, that tend to increase compliance costs that tend to limit innovation and ultimately harm the consumers, the very consumers in many instances that they're supposed to help. Want to thank, among others, are members of our Federal Trade Commission, one of whom we'll hear from in a few minutes and who will introduce shortly, and FTC Chair Andrew Ferguson, and Attorney General, Assistant Attorney General Slater for their leadership and prioritizing this issue and for sending witnesses from the Federal Trade Commission, and from the Department of Justice's antitrust division to highlight their findings. Deregulation tends to level the playing field by removing barriers that stifle free market dynamics. In such an environment competition policy flourishes as firms are incentivized to innovate, rather than being hindered. I've introduced a number of bills over the years that deal with this issue one way or another. I'd like to briefly describe three of those to give you a sort of a cross section of some of the approaches that we can take in this area. First, off act opportunities for fairness and farming, a piece of legislation I'm very proud of and that's been co sponsored by my Ranking Member, Senator Booker from New Jersey would reform the mandatory farmer assessment programs existing under federal law that the Got Milk campaign where they be fits what for dinner campaign. These are the kinds of things that are funded by these mandatory assessments to our farmers. Unfortunately, some programs have awarded unauthorized bonuses. For example, a USDA investigation found that one organization had used checkoff funds for $300,000 in bonuses and then asked for more funds to fix their their financial The situation the checkoff programs are all too often used by the largest players and the largest players in the Checkoff Program in the industry itself in order to entrench their position, while severely undermining the interests of independent producers, many of which tend to operate with much narrower margins already. And so that the expense added by the checkoff payments, which are mandatory have the effect of of attacks and disproportionately affecting them and quite adversely. This bipartisan legislation would require transparent financial reporting, it would ban conflicts of interest and mandate regular audits in this area. Second, the open America's waters Act would repeal the so called Jones Act. More than a century old federal restriction that's created something of a shipping monopoly, or at least a distortion in the marketplace. That ends up costing American consumers in some parts of the country more than others. Our domestic cargo fleet has during the little more than a century since that was enacted, shrunk to 92 ships. Half of what we had in 2020 23, American shipyards built only five large vessels while China built 1749. This artificial scarcity forces all of us to pay inflated shipping costs, especially people in certain parts of the country. Americans living in Alaska and Hawaii and Puerto Rico, Guam, and parts of New England suffered disproportionately for this, so to the extent this is going to be a policy, we need to at least take into account that it's a policy with enormous costs. That affects different Americans quite differently in some very severely depending on where they live. The Jones acts restrictions are so onerous that they even apply in many instances to transporting disaster relief supplies. The result is watching relief cargo sit idle. While Americans suffer after natural disasters, the open America waters Act would unlock competition, reduce shipping costs and allow consumers to receive goods faster. Third, the biosimilar red tape Elimination Act tackles artificial barriers in our healthcare system. When developing biosimilar drugs, which tend to be very expensive in the world of pharmaceuticals, companies face unnecessary regulatory hurdles that keep cheaper alternatives to the original branded product off the market. This bill would streamline the approval process by automatically deeming all approved biosimilars as interchangeable with their brand name counterparts. This would eliminate the significant amount of redundant switching costs, and switching studies that pharmaceutical companies use in order to delay competition and align regulation with current scientific reality. In each case, and in the case of other reform legislation. In this area, these bills removed needless government regulations, they would save billions of dollars, and that empower businesses to innovate to compete and deliver value to the American consumers. So let us continue to champion smart regulation for a prosperous America. I want to thank our witnesses for joining us today and look forward to introducing them in a few minutes and hearing their perspectives. In the meantime, let's turn it over to Ranking Member, Senator Booker.",
      "word_count": 1160
    },
    {
      "start": 466.0,
      "end": 618.0,
      "speaker": "RANKING",
      "text": "Really grateful to our ranking to our chairperson, for convening this hearing in partnership with us. And for so many of the areas in which we overlap. I want to note that one of the true great leaders on issues of antitrust is here next to me is Amy Klobuchar, who I know is under a lot of demand as Senator Blumenthal, there's a lot going on in the Senate today. I want to thank the witnesses for being here. It means a lot that you all would take time to come and give testimony this important hearing and I want to thank every sleep, you can see packed room standing room only want to definitely think the purple shirts here. I can recognize SEIU brothers and sisters when I see them. So thank you all for being here. Something that I know Michael and I agree on is just this concept of liberty in the United States. This idea of freedom. And part of that idea part of those conceptions is the idea of economic liberty as well that powerful anti competitive forces won't undermine the benefits you get from having liberty and the ideals and opportunities for people to enter into the marketplace in a competitive fashion that expands us sense of the reality of opportunity for everybody. I'm a big believer that personal liberty is directly tied to economic liberty, these two freedoms should not be restricted to some by people who violate some of those laws of liberty. Throughout my time as a Senator and before, I've worked to fight to make sure that all families and all workers really are able to access that liberty and not just the powerful, whether it's powerful political lobbies, or powerful concentrations of economic power. And when we talk about a competitive economy, what we're really talking about as ensuring that everyone has fair opportunities, and a level playing field that every entrepreneur making products people need, or want has things like access to capital to start their first business that every small business has tools to compete a fairly against even the dominant players that workers can switch jobs without being held back by non compete or non poach agreements between employers that undermined the power of labor.",
      "word_count": 380
    }
  ]
}